In [24]:
import pandas as pd

In [67]:
a_dic = {'apple':7, 'banana': 8, 'orange': 9 }
b_dic = {'peach':10}
s7 = pd.Series(a_dic)
s8 = pd.Series(b_dic)
s9 = pd.concat([s8, s7])

In [71]:
val = [[1,2,3],[4,5,6]]
df = pd.DataFrame(val, index=['r0','r1'], columns=['c0', 'c1', 'c2'])
print(df)

    c0  c1  c2
r0   1   2   3
r1   4   5   6

In [92]:
age = pd.Series([21,22,23,24])
gender = pd.Series(['m','r','r','m'])
height = pd.Series([175,174,173,172])
weight = pd.Series([30,31,32,33])
df_info = pd.DataFrame({
    'age': age,
    'gender': gender,
    'height': height,
    'weight': weight
})
print(df_info)

   age gender  height  weight
0   21      m     175      30
1   22      r     174      31
2   23      r     173      32
3   24      m     172      33

In [127]:
df_info[df_info['gender'] == 'm']

   age gender  height  weight  (0, height)
0   21      m     275      30          275
3   24      m     275      33          275

In [111]:
df_info.head(2)

   age gender  height  weight
0   21      m     175      30
1   22      r     174      31

In [128]:
df_info.loc[0, 'weight'] = 275

In [129]:
df_info

   age gender  height  weight  (0, height)
0   21      m     275     275          275
1   22      r     275      31          275
2   23      r     275      32          275
3   24      m     275      33          275

In [132]:
test = pd.Series(['a1','a2','a3'])
test2 = pd.Series(['b1','b2','b3'])
test3 = pd.Series(['c1','c2','c3'])
test4 = pd.Series(['d1','d2','d3'])
df_info2 = pd.DataFrame({
    'test' : test,
    'test2' : test2,
    'test3' : test3,
    'test4' : test4
})

In [133]:
df_info2

  test test2 test3 test4
0   a1    b1    c1    d1
1   a2    b2    c2    d2
2   a3    b3    c3    d3

In [174]:
df_info2.iloc[0, 3] = 101
df_info2['new'] = 1
df_info2.loc['inew'] = 0
df_info2

     test test2 test3 test4  new
0      a1    b1    c1   101    1
1      a2    b2    c2    d2    1
2      a3    b3    c3    d3    1
inew    0     0     0     0    0

In [176]:
df_info2.drop(labels=['inew'], axis=0, inplace=True)
df_info2

  test test2 test3
0   a1    b1    c1
1   a2    b2    c2
2   a3    b3    c3